/*
# 🧩 문제 정보
사이트: Programmers
레벨: Level 0
문제명: 겹치는 선분의 길이
유형: 수학
날짜: 2026-10-01
Review 여부: true

# 📰 문제 설명
- 세 선분의 길이의 시작, 끝 좌표가 [start, end] 형태로 들어있는 2차원배열 lines가 주어짐
- 선분 3개가 평행하게 놓여 있음
- 두 개 이상의 선분이 겹치는 부분의 길이를 반환하는 함수 만들기
 
# 💡 문제 풀이
- 방식1. 두번 겹치는 구간에서 세번 겹치는 구간 빼기

- 방식2. 카운팅 배열
  - arr 배열을 길이가 201이고 요소를 0으로 갖는 카운팅 배열로 초기화
  - offset 변수를 100으로 초기화
  - lines를 순회하며 각 선분의 좌표에 해당하는 인덱스를 1 증가
    - 이 때, 좌표의 범위는 음수가 포함되어 있음
    - 따라서 선분의 좌표에 offset을 더한 값을 이용
    - -100의 좌표를 0번 인덱스에 매칭하기 위해선 100을 더해야하므로 offset은 100
  - arr 요소의 값이 2 이상인 범위가 겹치는 부분
  - 따라서 arr배열을 순회하며 요소의 값이 2 이상인 요소의 개수를 반환 

- 방식3. 겹치는 구간 합치기

# ⏰ 시간복잡도 O(1)
- arr 배열의 크기는 201로 고정되어 있으므로 시간복잡도를 O(1)로 볼 수 있음
- 외부 for문은 lines의 길이만큼 반복하는데, 문제에서 lines의 길이는 3으로 고정되어 있으므로 시간복잡도는 O(1)이다.
- 내부 for문은 선분의 길이만큼 반복하는데, 문제에서 선분 좌표의 범위가 -100~100으로 고정되어있으므로 시간복잡도는 O(1)이다.
- 따라서 전체 시간복잡도는 O(1)이다.

# 🚀 알게 된 점
- reduce() 메서드의 콜백함수에서는 반드시 acc를 return 해주어야 함

# 💭 아쉬운 점
- 방식1의 포기
    - 처음에 시도한 방법은 방식1의 두번 겹치는 구간에서 세번 겹치는 구간 빼기였다.
    - 이는 수학적 개념으로 포함-배제의 원리로, 특정 상황에 대한 이해를 명확하게 하는 것이 필요했다.
    - 하지만, 두개의 선분이 겹치는 구간을 구하는 과정에서 중복된 구간이 저장되는 경우 세개의 선분이 겹치는 구간을 그만큼 더 빼줘야하는 상황이 존재했다.
    - 해당 예외 처리를 해주는 코드 작성에서 막혀 결국 다른 방식으로 접근하게 되었다.
    - 불가능한 방법은 아니었지만 문제 규모에 비해 코드의 복잡성이 크고, 
    - 선분이 3개 보다 더 큰 상황에 대해 코드의 확장성이 떨어진다는 부분에 있어서 해당 방법을 고집할 필요가 없다고 판단을 내렸다.

- 방식2의 접근성
    - 카운팅 배열을 생성하고, 선분의 범위에 해당하는 인덱스의 요소를 증가시키는 아이디어는 떠올렸으나,
    - 카운팅 배열의 인덱스에 접근하는 방법에 대해 어려움을 느꼈었다. -> 좌표에 오프셋 적용하기
    - 또한, 본인은 카운팅 배열의 크기를 주어진 좌표값에 따라 유동적으로 접근했는데
    - 문제에서 선분의 좌표 범위가 -100 ~ +100으로 주어져있는 것을 이용하는 것이 보다 코드를 간결하게 만들어준다는 점을 알게되었다.    

*/

function solution(lines) {
  const arr = new Array(201).fill(0);
  const offset = 100;

  for (const line of lines) {
    for (let i = line[0] + offset; i < line[1] + offset; i++) {
      arr[i]++;
    }
  }

  return arr.reduce((acc, cur) => {
    if (cur >= 2) acc++;
    return acc;
  }, 0);
}

console.log(
  solution([
    [0, 5],
    [3, 9],
    [1, 10],
  ]),
);
