/*
# 🧩 문제 정보
사이트: Programmers
레벨: Level 1
문제명: 최소직사각형
유형: 구현
날짜: 2026-10-15
Review 여부: true

# 📰 문제 설명
- 명함 지갑에서 모든 명함을 수납할 수 있는 최소 크기의 명함 지갑을 만들 예정임
- 조사한 명함들의 [가로길이, 세로길이]를 요소로 갖는 2차원 배열 sizes가 주어짐
- 명함은 그대로 혹은 눕혀서 수납할 수 있음
- 이를 고려하여 최소 크기의 명함 지갑의 크기를 반환하는 함수 만들기 

# 💡 문제 풀이
- [[60, 50], [30, 70], [60, 30], [80, 40]] 해당 케이스에서
- 가로길이의 최대값은 80, 세로길이의 최대값은 70이지만,
- 2번 명함을 눕혀서 수납하는 경우, 가로길이의 최대값은 80, 세로길이의 최대값은 50이 되므로
- 최대 크기가 갱신될 수 있다.
- 따라서, 모든 명함들의 가로길이, 세로길이 순서쌍을 내림차순으로 정렬한다.
- 그 후에 각 명함들의 첫번째 요소들 중 최대값과 두번째 요소들 중 최대값을 곱한 값을 반환한다.

- 유도 코드
    - arr1과 arr2를 []로 초기화
    - for문으로 sizes를 순회하며 다음 작업을 수행
        - sizes[i].sort((a,b) => b-a)를 수행
        - arr1.push(sizes[i][0])
        - arr2.push(sizes[i][1])
    - for문 종료 후, Math.max(...arr1) * Math.max(...arr2)를 반환 

# ⏰ 시간복잡도 O(N)
- for문은 sizes의 배열의 길이만큼 반복한다.
- for문 내부의 sort() 메서드의 시간복잡도는 대상 배열의 길이가 항상 2로 고정되어 있으므로 O(1)이다.
- Math.max() 메서드 역시 ..arr1의 길이가 sizes의 길이와 같으므로 시간복잡도는 O(N)이다.
- for문과 Math.max() 연산은 순차 수행되므로, 전체 시간복잡도는 O(N)이다.

# 🚀 알게 된 점

# 💭 아쉬운 점
- ES6문법의 메서드를 활용하여 풀어보고 싶다.

*/

function solution(sizes) {
  const [arr1, arr2] = [[], []];

  for (let i = 0; i < sizes.length; i++) {
    sizes[i].sort((a, b) => b - a);
    arr1.push(sizes[i][0]);
    arr2.push(sizes[i][1]);
  }

  return Math.max(...arr1) * Math.max(...arr2);
}

console.log(
  solution([
    [60, 50],
    [30, 70],
    [60, 30],
    [80, 40],
  ]),
);
