/*
# 🧩 문제 정보
사이트: Programmers
레벨: Level 0
문제명: 평행
유형: 수학
날짜: 2026-09-29
Review 여부: true

# 📰 문제 설명
- 점 네개의 좌표를 담은 이차원 배열 dots가 주어짐
- 주어진 네 개의 점을 두개씩 이었을 때, 
- 두 직선이 평행이 되는 경우가 있으면 1을, 없으면 0을 반환하는 함수 만들기

# 💡 문제 풀이
- 방식1. 조합의 경우의 수를 나눠보기
  - 네 점을 각각 a, b, c, d라고 하자
  - 조합의 경우의 수
    1. a, b / c, d
    2. a, c / b, d
    3. a, d / b, c
  - 세 가지 경우에 대해 기울기가 같은지를 판별
  - 평행 한 경우가 하나라도 존재한다면 1을 반환
  - 아니라면 0을 반환

  - 이 때, 기울기는 분수가 아닌 소수의 형태로 저장되므로 오차 발생의 가능성이 존재
  - 따라서 분수의 비교를 곱셉의 비교로 변환한다.
  - 예시: A/B = C/D 를 비교 -> AxD = CxB 로 비교

- 방식2. Set 활용
  - 네 점 중 두 점을 선택해서 구한 기울기들을 Set에 저장함
  - 이 때, 소수의 형태로 저장 시 오차가 발생할 수 있으므로, 기약 분수의 형태로 저장함 
  - 기약분수 형식: "분자/분모"의 문자열 형태 (- 부호는 분자쪽으로 통일)

# ⏰ 시간복잡도 O(1)
- 방식1: 단순 수식 연산만 있으므로 전체 시간복잡도는 O(1)이다.

# 🚀 알게 된 점
- 방식1의 알게된 점
  - 분수는 컴퓨터에서 소수값으로 인식함
  - 컴퓨터의 메모리에는 한계가 존재하므로 무한소수는 값을 반올림하면서 오차가 발생함
  - 따라서 분수를 비교할 때는 곱셈으로 변환하여 수행

- 방식2의 알게된 점 
  - 기약분수는 분자와 분모의 최대공약수를 각각 나눠주면 됨

# 💭 아쉬운 점
- Set에 기울기를 저장하고, 길이를 비교하는 방식을 이용하려 함
  - 기울기는 분수로 곧 소수이므로 무한소수인 경우 메모리 한계로 인해 오차가 발생한다.
  - 따라서 기약분수로 변환 후, 문자열의 형태로 저장하는 방법을 알게 되었다.
  - 분수를 소수가 아닌 다른 방법으로 처리하는 방법에 대한 아이디어를 스스로 떠올리지 못한 점이 아쉬웠다.

*/

function solution(dots) {
  const a = dots[0];
  const b = dots[1];
  const c = dots[2];
  const d = dots[3];

  if ((a[0] - b[0]) * (c[1] - d[1]) === (c[0] - d[0]) * (a[1] - b[1])) return 1;
  else if ((a[0] - c[0]) * (b[1] - d[1]) === (b[0] - d[0]) * (a[1] - c[1])) return 1;
  else if ((a[0] - d[0]) * (c[1] - b[1]) === (c[0] - b[0]) * (a[1] - d[1])) return 1;
  else return 0;
}

console.log(solution(5));
