/*
# 🧩 문제 정보
사이트: Programmers
레벨: Level 0
문제명: 종이 자르기
유형: 구현
날짜: 2026-10-07
Review 여부: false

# 📰 문제 설명
- M x N 크기로 종이를 자를 예정
- 종이는 겹쳐서 자를 수 없음
- M x N 크기로 종이를 자를 때 필요한 가위질의 최소 횟수를 반환하는 함수 만들기

# 💡 문제 풀이
- M을 열, N을 행이라고 하자
- 열과 행 모두, n개의 조각으로 자를 때 각각 n - 1번의 가위질을 한다.
- 즉, 종이를 세로로 M장의 조각으로 자를 때 M - 1번 가위질을 한다.
- 이어서 종이를 가로로 N장의 조각으로 자를 때 N - 1번 가위질을 하는데,
- M장의 종이에 대해서 N - 1 번 자른다.
- 따라서 (M - 1) + M x (N - 1)을 반환한다.

# ⏰ 시간복잡도 O(1)
- 단순 수식 연산이므로 시간복잡도는 O(1)이다.

# 🚀 알게 된 점

# 💭 아쉬운 점

*/

function solution(M, N) {
  return M - 1 + M * (N - 1);
}

console.log(solution(5));
